<template>
  <div>
    <div>
      <div class="flex items-center justify-between px-2">
        <h3 class="text-2xl font-bold flex space-x-2 space-x-reverse items-center">
          پیغام ها
        </h3>
        <button class="flex items-center space-x-2 space-x-reverse text-primary">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M7.70711 11.2929C7.31658 10.9024 6.68342 10.9024 6.29289 11.2929C5.90237 11.6834 5.90237 12.3166 6.29289 12.7071L7.70711 11.2929ZM11.9497 16.9497L11.2426 17.6569C11.6332 18.0474 12.2663 18.0474 12.6568 17.6569L11.9497 16.9497ZM23.2639 7.05026C23.6544 6.65975 23.6544 6.02658 23.2639 5.63605C22.8734 5.24552 22.2402 5.2455 21.8497 5.63602L23.2639 7.05026ZM2.75691 11.3432C2.36639 10.9527 1.73322 10.9527 1.3427 11.3432C0.952174 11.7337 0.952174 12.3669 1.3427 12.7574L2.75691 11.3432ZM6.29245 17.7071C6.68297 18.0977 7.31613 18.0977 7.70666 17.7071C8.09718 17.3166 8.09718 16.6835 7.70666 16.2929L6.29245 17.7071ZM18.3131 7.10054C18.7037 6.71002 18.7037 6.07685 18.3131 5.68633C17.9226 5.2958 17.2895 5.2958 16.8989 5.68633L18.3131 7.10054ZM11.5956 10.9896C11.2051 11.3802 11.2051 12.0133 11.5956 12.4038C11.9862 12.7944 12.6193 12.7944 13.0098 12.4038L11.5956 10.9896ZM6.29289 12.7071L11.2426 17.6569L12.6569 16.2426L7.70711 11.2929L6.29289 12.7071ZM12.6568 17.6569L23.2639 7.05026L21.8497 5.63602L11.2427 16.2426L12.6568 17.6569ZM1.3427 12.7574L6.29245 17.7071L7.70666 16.2929L2.75691 11.3432L1.3427 12.7574ZM16.8989 5.68633L11.5956 10.9896L13.0098 12.4038L18.3131 7.10054L16.8989 5.68633Z" fill="currentColor"/>
          </svg>
          <span>
                همه را خواندم
          </span>
        </button>
      </div>

      <hr class="my-3 border-2">
    </div>
    <ul class="flex flex-col space-y-4">
      <li class="flex flex-col space-y-3 p-4 rounded-lg bg-bgWhite drop-shadow border-r-primary opacity-60 hover:opacity-100 transition duration-200 first:opacity-100 first:border-r-4" v-for="i in 3" :key="i">
        <strong>عنوان پیغام</strong>
        <hr>
        <p class="mt-4 font-estedad font-light text-sm text-justify">
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارها.
        </p>
      </li>
    </ul>
  </div>
</template>

<script setup lang="ts">
definePageMeta({
  layout:'profile'
})
</script>