<template>
  <div class="container mx-auto flex flex-col items-center mt-16">

    <Head>
      <Title>ارتباط با چی پی</Title>
    </Head>

    <h2 class="text-xl md:text-2xl xl:text-5xl font-semibold">ارتباط با <span class="text-brandOrange">جی پی</span></h2>
    <div class="md:p-8">
      <div class="flex mt-8 md:mt-12 items-center justify-between">
        <strong class="text-sm font-light md:text-2xl opacity-70">جهت ارتباط با ما از فرم زیر استفاده کنید</strong>
        <NuxtLink to="/" class="hidden md:block text-brandOrange font-semibold">جهت رفتن به صفحه اول جی پی کلیک کنید</NuxtLink>
      </div>
      <hr class="my-4 md:my-8">
      <div class="grid md:grid-cols-2 gap-2 md:gap-8">
        <Form @submit="sendMessage" class="grid md:grid-cols-2 gap-2 md:gap-4">
          <base-g-input label="نام و نام خانوادگی*"  required name="fullName" id="fullName" v-model="contactMessage.fullName"/>
          <base-g-input label="ایمیل*"  required name="email" id="email" v-model="contactMessage.email"/>
          <base-g-input label="شماره تلفن*"  required name="phoneNumber" id="phoneNumber" v-model="contactMessage.phoneNumber"/>
          <base-g-input label="موضوع*"  required name="subject" id="subject" v-model="contactMessage.subject"/>
          <div class="col-span-full">
            <base-g-input label="متن پیام*" multi-line required name="content" id="content" v-model="contactMessage.text"/>
          </div>
          <div></div>
          <base-g-button color="primary" type="submit" w-full>ثبت و ارسال</base-g-button>
        </Form>
        <div style="height: 40vh; width:100%" class="rounded-2xl border overflow-hidden z-10 mt-5 md:mt-0">
          <LMap
              ref="map"
              :zoom="16"
              :center="[35.29199744307878, 59.16538418430383]"
          >
            <LTileLayer
                url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"
                attribution="&amp;copy; <a href=&quot;https://www.openstreetmap.org/&quot;>OpenStreetMap</a> contributors"
                layer-type="base"
                name="OpenStreetMap"
            />
            <LMarker :draggable="false" name="GP Saffron" attribution="GP Saffron"  :lat-lng="[35.29199744307878, 59.16538418430383]">
              <LPopup content="شرکت فراز زعفران تربت"  />
            </LMarker>
          </LMap>
        </div>
      </div>
      <div class="my-12 bg-[#F8F8F8] rounded-2xl md:p-8">
        <h3 class="md:pr-4 md:border-r-4 border-brandOrange text-xl md:text-3xl font-bold">اطلاعات <strong class="text-brandOrange">جی پی</strong></h3>
        <div class="bg-white flex flex-col items-start p-7 rounded-xl mt-8">
          <div class="flex flex-col items-start space-y-4">
            <div class="flex items-center gap-2 md:gap-4">
              <svg width="31" height="32" viewBox="0 0 31 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M15.5012 28.8002C15.5012 28.8002 25.2056 19.8958 25.2056 13.2176C25.2056 7.68513 20.8608 3.2002 15.5012 3.2002C10.1417 3.2002 5.79688 7.68513 5.79688 13.2176C5.79688 19.8958 15.5012 28.8002 15.5012 28.8002Z" fill="#F14823"/>
                <path d="M18.6016 12.8004C18.6016 14.5677 17.2137 16.0004 15.5016 16.0004C13.7895 16.0004 12.4016 14.5677 12.4016 12.8004C12.4016 11.0331 13.7895 9.6004 15.5016 9.6004C17.2137 9.6004 18.6016 11.0331 18.6016 12.8004Z" fill="#F14823"/>
                <path d="M15.5012 28.8002C15.5012 28.8002 25.2056 19.8958 25.2056 13.2176C25.2056 7.68513 20.8608 3.2002 15.5012 3.2002C10.1417 3.2002 5.79688 7.68513 5.79688 13.2176C5.79688 19.8958 15.5012 28.8002 15.5012 28.8002Z" stroke="#FCFCFC" stroke-width="3"/>
                <path d="M18.6016 12.8004C18.6016 14.5677 17.2137 16.0004 15.5016 16.0004C13.7895 16.0004 12.4016 14.5677 12.4016 12.8004C12.4016 11.0331 13.7895 9.6004 15.5016 9.6004C17.2137 9.6004 18.6016 11.0331 18.6016 12.8004Z" stroke="#FCFCFC" stroke-width="3"/>
              </svg>
              <strong class="text-lg md:text-xl text-[#7E7E7E] ">دفتر مرکزی</strong>
            </div>
            <span class="text-[#8D8D8D]">استان خراسان رضوی - شهرستان تربت حیدریه - کیلومتر 2 جاده بایگ</span>
            <span class="text-[#8D8D8D]">ساعت کاری :   <strong class="text-[#8D8D8D] mr-2">شنبه تا پنج شنبه از ساعت 8:00 تا 14:00  </strong></span>
            <a href="tel:05152329059" class="text-[#8D8D8D]">شماره تماس :    <strong class="text-[#8D8D8D] mr-2">52329059-051</strong></a>
            <a href="mailto:info@gpsaffron.com" class="text-[#8D8D8D]">ایمیل :    <strong class="text-[#8D8D8D] mr-2">info@gpsaffron.com</strong></a>
          </div>
          <div class="flex flex-col items-start space-y-4 mt-8">
            <strong class="text-lg md:text-xl text-[#7E7E7E]">خدمات پس از فروش</strong>
            <p class="text-[#8D8D8D] leading-relaxed md:leading-8 font-light">
              برای بازگردانی به خدمات پس از فروش جی پی از طریق پست، تنها به صندوق پستی <span dir="ltr">95189-55620</span> ارسال کنید. (شما می‌توانید از طریق تماس با پشتیبان اقدام به بازگردانی کالا کنید)
              <br>
              <span class="font-bold">لطفا توجه داشته باشید بازگرداندن کالا ، تنها منحصر به کالاهای کمتر از 0/5 مثقال می باشد.</span>
            </p>
          </div>
        </div>

      </div>

      <div class="flex flex-col md:items-center space-y-4 md:space-y-6">
        <div class="flex items-center gap-2 md:gap-6">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M15.5588 15.1987C16.0827 15.3733 16.649 15.0902 16.8237 14.5662C16.9983 14.0423 16.7152 13.476 16.1912 13.3013L15.5588 15.1987ZM12.5 13.125H11.5C11.5 13.5554 11.7754 13.9376 12.1838 14.0737L12.5 13.125ZM13.5 8.42087C13.5 7.86858 13.0523 7.42087 12.5 7.42087C11.9477 7.42087 11.5 7.86858 11.5 8.42087H13.5ZM16.1912 13.3013L12.8162 12.1763L12.1838 14.0737L15.5588 15.1987L16.1912 13.3013ZM13.5 13.125V8.42087H11.5V13.125H13.5ZM20.5 12C20.5 16.4183 16.9183 20 12.5 20V22C18.0228 22 22.5 17.5228 22.5 12H20.5ZM12.5 20C8.08172 20 4.5 16.4183 4.5 12H2.5C2.5 17.5228 6.97715 22 12.5 22V20ZM4.5 12C4.5 7.58172 8.08172 4 12.5 4V2C6.97715 2 2.5 6.47715 2.5 12H4.5ZM12.5 4C16.9183 4 20.5 7.58172 20.5 12H22.5C22.5 6.47715 18.0228 2 12.5 2V4Z" fill="#747474"/>
          </svg>
          <strong class="text-sm md:text-xl opacity-60">پاسخگویی 24 ساعته و 7 روز هفته</strong>
        </div>
        <div class="grid md:grid-cols-4 gap-4">
          <div class="bg-[#F8F8F8] border rounded-3xl border-[#DFDFDF] p-4 flex items-center gap-6">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" class="scale-150">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M12.25 8.5C11.285 8.5 10.5 9.285 10.5 10.251C10.5 11.216 11.285 12 12.25 12C13.215 12 14 11.216 14 10.251C14 9.285 13.215 8.5 12.25 8.5ZM12.25 13.5C10.458 13.5 9 12.043 9 10.251C9 8.458 10.458 7 12.25 7C14.042 7 15.5 8.458 15.5 10.251C15.5 12.043 14.042 13.5 12.25 13.5Z" fill="black"/>
              <mask id="mask0_572_2284" style="mask-type:luminance" maskUnits="userSpaceOnUse" x="4" y="2" width="17" height="20">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M4 2H20.4995V21.5H4V2Z" fill="white"/>
              </mask>
              <g mask="url(#mask0_572_2284)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M12.25 3.5C8.528 3.5 5.5 6.557 5.5 10.313C5.5 15.092 11.124 19.748 12.25 19.996C13.376 19.747 19 15.091 19 10.313C19 6.557 15.972 3.5 12.25 3.5ZM12.25 21.5C10.456 21.5 4 15.948 4 10.313C4 5.729 7.701 2 12.25 2C16.799 2 20.5 5.729 20.5 10.313C20.5 15.948 14.044 21.5 12.25 21.5Z" fill="black"/>
              </g>
            </svg>
            <div class="flex flex-col items-start">
              <strong class="text-xl opacity-70">آدرس</strong>
              <span class="opacity-60">خراسان رضوی <br> تربت حیدریه کیلومتر 2 جاده بایگ</span>
            </div>
          </div>
          <div class="bg-[#F8F8F8] border rounded-3xl border-[#DFDFDF] p-4 flex items-center gap-6">
            <svg class="w-6" opacity="0.7" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M8 1.44062C10.1375 1.44062 10.3906 1.45 11.2313 1.4875C12.0125 1.52187 12.4344 1.65313 12.7156 1.7625C13.0875 1.90625 13.3563 2.08125 13.6344 2.35938C13.9156 2.64062 14.0875 2.90625 14.2313 3.27813C14.3406 3.55938 14.4719 3.98438 14.5063 4.7625C14.5438 5.60625 14.5531 5.85938 14.5531 7.99375C14.5531 10.1313 14.5438 10.3844 14.5063 11.225C14.4719 12.0063 14.3406 12.4281 14.2313 12.7094C14.0875 13.0813 13.9125 13.35 13.6344 13.6281C13.3531 13.9094 13.0875 14.0813 12.7156 14.225C12.4344 14.3344 12.0094 14.4656 11.2313 14.5C10.3875 14.5375 10.1344 14.5469 8 14.5469C5.8625 14.5469 5.60938 14.5375 4.76875 14.5C3.9875 14.4656 3.56563 14.3344 3.28438 14.225C2.9125 14.0813 2.64375 13.9063 2.36563 13.6281C2.08438 13.3469 1.9125 13.0813 1.76875 12.7094C1.65938 12.4281 1.52813 12.0031 1.49375 11.225C1.45625 10.3813 1.44688 10.1281 1.44688 7.99375C1.44688 5.85625 1.45625 5.60313 1.49375 4.7625C1.52813 3.98125 1.65938 3.55938 1.76875 3.27813C1.9125 2.90625 2.0875 2.6375 2.36563 2.35938C2.64688 2.07812 2.9125 1.90625 3.28438 1.7625C3.56563 1.65313 3.99063 1.52187 4.76875 1.4875C5.60938 1.45 5.8625 1.44062 8 1.44062ZM8 0C5.82813 0 5.55625 0.009375 4.70313 0.046875C3.85313 0.084375 3.26875 0.221875 2.7625 0.41875C2.23438 0.625 1.7875 0.896875 1.34375 1.34375C0.896875 1.7875 0.625 2.23438 0.41875 2.75938C0.221875 3.26875 0.084375 3.85 0.046875 4.7C0.009375 5.55625 0 5.82812 0 8C0 10.1719 0.009375 10.4438 0.046875 11.2969C0.084375 12.1469 0.221875 12.7313 0.41875 13.2375C0.625 13.7656 0.896875 14.2125 1.34375 14.6562C1.7875 15.1 2.23438 15.375 2.75938 15.5781C3.26875 15.775 3.85 15.9125 4.7 15.95C5.55313 15.9875 5.825 15.9969 7.99688 15.9969C10.1688 15.9969 10.4406 15.9875 11.2938 15.95C12.1438 15.9125 12.7281 15.775 13.2344 15.5781C13.7594 15.375 14.2063 15.1 14.65 14.6562C15.0938 14.2125 15.3688 13.7656 15.5719 13.2406C15.7688 12.7313 15.9063 12.15 15.9438 11.3C15.9813 10.4469 15.9906 10.175 15.9906 8.00313C15.9906 5.83125 15.9813 5.55938 15.9438 4.70625C15.9063 3.85625 15.7688 3.27188 15.5719 2.76562C15.375 2.23438 15.1031 1.7875 14.6563 1.34375C14.2125 0.9 13.7656 0.625 13.2406 0.421875C12.7313 0.225 12.15 0.0875 11.3 0.05C10.4438 0.009375 10.1719 0 8 0Z" fill="#18110A"/>
              <path d="M8 3.89062C5.73125 3.89062 3.89062 5.73125 3.89062 8C3.89062 10.2688 5.73125 12.1094 8 12.1094C10.2688 12.1094 12.1094 10.2688 12.1094 8C12.1094 5.73125 10.2688 3.89062 8 3.89062ZM8 10.6656C6.52813 10.6656 5.33437 9.47188 5.33437 8C5.33437 6.52813 6.52813 5.33437 8 5.33437C9.47188 5.33437 10.6656 6.52813 10.6656 8C10.6656 9.47188 9.47188 10.6656 8 10.6656Z" fill="#18110A"/>
              <path d="M13.2312 3.72811C13.2312 4.25936 12.8 4.68749 12.2719 4.68749C11.7406 4.68749 11.3125 4.25624 11.3125 3.72811C11.3125 3.19686 11.7438 2.76874 12.2719 2.76874C12.8 2.76874 13.2312 3.19999 13.2312 3.72811Z" fill="#18110A"/>
            </svg>
            <div class="flex flex-col items-start">
              <strong class="text-xl opacity-70">اینستاگرام</strong>
              <span class="opacity-60">GP_Saffron@</span>
            </div>
          </div>
          <div class="bg-[#F8F8F8] border rounded-3xl border-[#DFDFDF] p-4 flex items-center gap-6">
            <svg class="w-6" opacity="0.7" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M0 16L1.12466 11.8913C0.430666 10.6886 0.0659999 9.32531 0.0666665 7.92732C0.0686665 3.55666 3.62533 0 7.99532 0C10.116 0.000666665 12.1066 0.826665 13.604 2.32533C15.1006 3.82399 15.9246 5.81599 15.924 7.93465C15.922 12.306 12.3653 15.8626 7.99532 15.8626C6.66865 15.862 5.36132 15.5293 4.20332 14.8973L0 16ZM4.39799 13.462C5.51532 14.1253 6.58198 14.5226 7.99265 14.5233C11.6246 14.5233 14.5833 11.5673 14.5853 7.93332C14.5866 4.29199 11.642 1.34 7.99798 1.33866C4.36332 1.33866 1.40666 4.29466 1.40533 7.92798C1.40466 9.41131 1.83933 10.522 2.56933 11.684L1.90333 14.116L4.39799 13.462ZM11.9893 9.81931C11.94 9.73665 11.808 9.68731 11.6093 9.58798C11.4113 9.48865 10.4373 9.00931 10.2553 8.94331C10.074 8.87731 9.94198 8.84398 9.80931 9.04265C9.67731 9.24065 9.29731 9.68731 9.18198 9.81931C9.06665 9.95131 8.95065 9.96798 8.75265 9.86865C8.55465 9.76931 7.91598 9.56065 7.15932 8.88531C6.57065 8.35998 6.17265 7.71132 6.05732 7.51265C5.94199 7.31465 6.04532 7.20732 6.14399 7.10865C6.23332 7.01998 6.34199 6.87732 6.44132 6.76132C6.54199 6.64665 6.57465 6.56399 6.64132 6.43132C6.70732 6.29932 6.67465 6.18332 6.62465 6.08399C6.57465 5.98532 6.17865 5.00999 6.01399 4.61332C5.85265 4.22732 5.68932 4.27932 5.56799 4.27332L5.18799 4.26666C5.05599 4.26666 4.84132 4.31599 4.65999 4.51466C4.47866 4.71332 3.96666 5.19199 3.96666 6.16732C3.96666 7.14265 4.67666 8.08465 4.77532 8.21665C4.87466 8.34865 6.17199 10.35 8.15932 11.208C8.63198 11.412 9.00131 11.534 9.28865 11.6253C9.76331 11.776 10.1953 11.7546 10.5366 11.704C10.9173 11.6473 11.7086 11.2246 11.874 10.762C12.0393 10.2986 12.0393 9.90198 11.9893 9.81931Z" fill="#18110A"/>
            </svg>
            <div class="flex flex-col items-start">
              <strong class="text-xl opacity-70">واتساپ</strong>
              <span dir="ltr" class="opacity-60">+98 9912937952</span>
            </div>
          </div>
          <div class="bg-[#F8F8F8] border rounded-3xl border-[#DFDFDF] p-4 flex items-center gap-6">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M3.28872 4.08785L3.36127 4.01204C5.28869 2.08444 6.54385 1.57351 7.88307 2.34362C8.2683 2.56515 8.62945 2.87523 9.12054 3.37401L10.6269 4.93603C11.4589 5.84393 11.6481 6.71478 11.3772 7.73465L11.3398 7.86967L11.2984 8.00392L11.097 8.59474C10.666 9.91972 10.846 10.6673 12.3795 12.2004C13.9742 13.7947 14.7186 13.9251 16.1457 13.4264L16.4001 13.338L16.7077 13.2381L16.8423 13.2007C17.9263 12.9115 18.842 13.1423 19.8132 14.1128L21.0269 15.2852L21.3842 15.6366C21.7803 16.0405 22.0421 16.3606 22.2355 16.6989C23.0008 18.0377 22.4893 19.2921 20.5063 21.2677L20.3177 21.4589C20.0216 21.7442 19.745 21.9486 19.3386 22.1416C18.6565 22.4655 17.8506 22.5876 16.9142 22.4573C14.6067 22.1364 11.6802 20.3158 7.97188 16.6085C7.67002 16.3067 7.3809 16.0107 7.10425 15.7205L6.56748 15.1476C1.53762 9.68285 1.09389 6.32588 3.15518 4.2205L3.28872 4.08785ZM7.90641 4.28093C7.58062 3.95973 7.34396 3.76394 7.13532 3.64396C6.67379 3.37856 6.1755 3.49074 5.25329 4.28448L4.96353 4.54334C4.91299 4.59 4.86129 4.63843 4.80838 4.68868L4.47611 5.01231L4.44617 5.04972L4.22091 5.27603C3.67656 5.83204 3.41871 6.51064 3.6409 7.67767C4.00551 9.59269 5.67442 12.1905 9.0324 15.5477C12.5313 19.0456 15.1972 20.7041 17.1208 20.9716C18.2422 21.1276 18.8142 20.856 19.3975 20.2584L19.8424 19.8095C20.051 19.5912 20.2292 19.3933 20.3797 19.2126L20.585 18.9539C21.1097 18.2551 21.1576 17.8358 20.9332 17.4433C20.8479 17.2939 20.7237 17.1302 20.5429 16.93L20.2977 16.671L20.1525 16.5258L18.6213 15.0472C18.1096 14.5753 17.7599 14.5084 17.229 14.65L17.0757 14.6941L16.4414 14.9094C14.6013 15.5037 13.2738 15.2155 11.3189 13.2612C9.29429 11.237 9.05685 9.88537 9.73522 7.93917L9.77874 7.81411L9.89908 7.45153L9.95823 7.22043C10.0631 6.71746 9.94337 6.36677 9.40269 5.82601C9.38043 5.80375 9.35555 5.77866 9.32847 5.7512L7.90641 4.28093Z" fill="black"/>
            </svg>
            <div class="flex flex-col items-start">
              <strong class="text-xl opacity-70">تلفن تماس</strong>
              <span dir="ltr" class="opacity-60">051 - 52329059</span>
            </div>
          </div>
        </div>
      </div>
    </div>

  </div>
</template>

<script lang="ts" setup>
import {Form} from "vee-validate";
import {SendContactForm} from "~/services/contact.service";
import type {SendContactFormCommand} from "~/models/contact/contactCommands";

const contactMessage:SendContactFormCommand = reactive({
  fullName:'',
  phoneNumber:'',
  email:'',
  subject:'',
  text:''
})

const toast = useToast();
const loading = ref(false);

const sendMessage = async ()=>{
  loading.value = true;

  const result = await SendContactForm(contactMessage);
  if(result.isSuccess){
    toast.showToast();
  }
  else{
    toast.showError(result.metaData)
  }

  loading.value = false;
}

</script>
