<template>
  <div class="relative -z-10 mt-8 mx-2 lg:mx-0">
    <Head>
      <Title>جی پی زعفران | GP Saffron</Title>
    </Head>

    <video autoplay muted loop class="hidden md:block rounded-2xl h-[40vh] w-full object-cover origin-center " >
      <source src="~/assets/videos/bg2.mp4" type="video/mp4">
    </video>


    <img src="~/assets/images/Present.jpg" alt="present" class="hidden rounded-2xl mt-24 h-[40vh] w-full object-cover origin-center ">

    <div class="flex lg:hidden items-center flex-col">
      <div class="flex items-center flex-row-reverse mx-4 mt-2">
        <div class="w-1/2 ">
          <img src="~/assets/images/gp-flower-cuted.png" alt="GP" class="max-h-36 object-cover mx-auto contrast-150 animate-pulse">
        </div>
        <div class="flex flex-col items-start space-y-3 p-4 lg:hidden w-1/2">
          <div class="w-max flex items-center justify-center mx-auto font-bold gap-2 drop-shadow-lg animate-pulse">
            <strong>
              به
            </strong>
            <img src="~/assets/images/gp-filled.png" alt="gp filled logo" class="w-10 lg:w-40">
            <strong>خوش آمدید</strong>
          </div>
          <div class="flex items-center justify-center mx-auto">
            <p class="text-wrap text-xs text-justify font-estedad ">
              <span>با جی پی همراه شوید و دنیای خاص و شگفت انگیز زعفران را لمس کنید، محصولی از مزارع حاصلخیز تا سفره های شما!</span>
            </p>
            <NuxtLink to="/" class="hidden bg-brandOrange -mb-10 mt-4 px-10 py-4 rounded-lg drop-shadow font-black">
              رفتن به صفحه محصولات
            </NuxtLink>
          </div>
        </div>
      </div>
    </div>
    <div class="w-max hidden lg:flex items-center justify-center mx-auto lg:text-white text-2xl lg:text-5xl font-bold md:absolute top-0 md:top-8 md:left-1/2 md:-translate-x-1/2 space-x-4 space-x-reverse scale-100 drop-shadow-lg animate-pulse">
      <strong>
        به
      </strong>
      <img src="~/assets/images/gp-filled.png" alt="gp filled logo" class="w-20 lg:w-40">
      <strong>خوش آمدید</strong>
    </div>


    <div class="absolute hidden flex-col text-white w-max max-w-max space-y-3 lg:space-y-6 rounded-2xl p-4 lg:p-8 lg:flex -right-0 -bottom-0">
      <div class="flex items-center space-x-2 space-x-reverse text-sm lg:text-4xl font-bold drop-shadow-md">
        <span>زعفرانِ</span>
        <img src="~/assets/images/gp-filled.png" alt="gp filled" class="w-10 lg:w-20">
      </div>
      <div class="h-px bg-bgWhite w-[120%] opacity-30"></div>
      <p class="text-wrap text-sm text-center lg:text-justify font-estedad font-thin lg:font-normal drop-shadow">
        <span>با جی پی همراه شوید و دنیای خاص و شگفت انگیز زعفران را لمس کنید، محصولی از مزارع حاصلخیز تا سفره های شما!</span>
        <br>
        <span>اینجا کیفیت و خلوص زعفران با اصالت همگام شده و تضمینی بر طعم این نماد با اصالت و گران بها خواهد بود.</span>
      </p>
      <NuxtLink to="/" class="hidden bg-brandOrange -mb-10 mt-4 px-10 py-4 rounded-lg drop-shadow font-black">
        رفتن به صفحه محصولات
      </NuxtLink>
    </div>

    <div class="hidden mx-auto bottom-0 right-1/2 translate-x-1/2 text-brandOrange animate-bounce relative">
      <a href="#products">
        <svg width="50" height="97" viewBox="0 0 50 97" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M25 59C33.8107 59 41 49.7325 41 38.375V24.625C41 13.2675 33.8107 4 25 4C16.1893 4 9 13.2675 9 24.625V38.375C9 49.7325 16.1893 59 25 59Z" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M25 25C23.8933 25 23 23.392 23 21.4V16.6C23 14.608 23.8933 13 25 13C26.0933 13 27 14.608 27 16.6V21.4C27 23.392 26.0933 25 25 25Z" fill="currentColor" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M25 12.5V4.16666" stroke="currentColor" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M32.92 65.95L26.4 72.47C25.63 73.24 24.37 73.24 23.6 72.47L17.08 65.95" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M32.92 73.95L26.4 80.47C25.63 81.24 24.37 81.24 23.6 80.47L17.08 73.95" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M32.92 81.95L26.4 88.47C25.63 89.24 24.37 89.24 23.6 88.47L17.08 81.95" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
      </a>
    </div>
  </div>

  <div class="mt-12 lg:mt-12 mx-4 lg:mx-0">
    <base-f-divider :logo-divider="false" title="محصولات ما">
      <template #left>
        <NuxtLink to="/market" class="text-xs lg:text-sm text-brandOrange underline underline-offset-4">مشاهده همه محصولات ></NuxtLink>
      </template>
    </base-f-divider>
    <ul class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 mt-8">
      <li v-for="i in lastProducts" :key="i.id">
        <f-card :product="i" />
      </li>
    </ul>
  </div>

<!--  <div class="mt-12 mx-4 lg:mx-0"> TODO Implement
    <base-f-divider :logo-divider="false" title="نظرات شما" />
    <ul class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 gap-y-24 lg:gap-y-8 mt-20">
      <li class="card bg-bgWhite dark:bg-gray-800 dark:text-white rounded-xl shadow-md pb-4" >
        <div class="w-full">
          <img src="~/assets/images/avatar.png" alt="saffron bar" class="rounded-full w-32 h-32 mx-auto -translate-y-1/2 border-brandOrange border-4">
        </div>
        <div class="w-full flex items-end justify-between -mt-16 px-12" >
          <div class="flex flex-col">
            <strong class="lg:text-2xl">غزاله رحمتی</strong>
            <span class="opacity-60 text-sm lg:text-base">گرافیست و طراح</span>
          </div>
          <div class="flex items-center">
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M9.15333 2.34001L10.3267 4.68668C10.4867 5.01334 10.9133 5.32668 11.2733 5.38668L13.4 5.74001C14.76 5.96668 15.08 6.95334 14.1 7.92668L12.4467 9.58001C12.1667 9.86001 12.0133 10.4 12.1 10.7867L12.5733 12.8333C12.9467 14.4533 12.0867 15.08 10.6533 14.2333L8.66 13.0533C8.3 12.84 7.70667 12.84 7.34 13.0533L5.34667 14.2333C3.92 15.08 3.05333 14.4467 3.42667 12.8333L3.9 10.7867C3.98667 10.4 3.83333 9.86001 3.55333 9.58001L1.9 7.92668C0.926667 6.95334 1.24 5.96668 2.6 5.74001L4.72667 5.38668C5.08 5.32668 5.50667 5.01334 5.66667 4.68668L6.84 2.34001C7.48 1.06668 8.52 1.06668 9.15333 2.34001Z" stroke="#CCA253" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>

          </div>
        </div>
        <hr class="my-4 mx-4">
        <div class="flex flex-col px-12 font-estedad text-justify space-y-2">
          <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.5">
              <path d="M10.9999 5.82501H8.09994C7.33494 5.82501 6.80994 5.245 6.80994 4.535V2.92499C6.80994 2.21499 7.33494 1.63501 8.09994 1.63501H9.70994C10.4199 1.63501 10.9999 2.21499 10.9999 2.92499V5.82501Z" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M11 5.82495C11 8.84995 10.435 9.34992 8.73499 10.3599" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M5.185 5.82501H2.285C1.52 5.82501 0.994995 5.245 0.994995 4.535V2.92499C0.994995 2.21499 1.52 1.63501 2.285 1.63501H3.9C4.61 1.63501 5.19 2.21499 5.19 2.92499V5.82501" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M5.18504 5.82495C5.18504 8.84995 4.62004 9.34992 2.92004 10.3599" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
            </g>
          </svg>
          <p class="text-sm lg:text-base">
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارها.
          </p>
          <svg class="mr-auto" width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.5">
              <path d="M1 6.17499H3.9C4.665 6.17499 5.19 6.755 5.19 7.465V9.07501C5.19 9.78501 4.665 10.365 3.9 10.365H2.29C1.58 10.365 1 9.78501 1 9.07501V6.17499Z" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M1.00001 6.17505C1.00001 3.15005 1.56501 2.65008 3.26501 1.64008" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M6.815 6.17499H9.715C10.48 6.17499 11.005 6.755 11.005 7.465V9.07501C11.005 9.78501 10.48 10.365 9.715 10.365H8.1C7.39 10.365 6.81 9.78501 6.81 9.07501V6.17499" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M6.81502 6.17505C6.81502 3.15005 7.38002 2.65008 9.08002 1.64008" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
            </g>
          </svg>
        </div>
        <div class="w-full flex relative">
          <NuxtLink to="/" class="bg-[#EF4056] w-max text-white px-6 py-2 rounded-full mx-auto absolute right-1/2 translate-x-1/2 bottom-0 translate-y-3/4 text-sm lg:text-base">
            مشاهده نظر در دیجی کالا
          </NuxtLink>
        </div>
      </li>
      <li class="card bg-bgWhite dark:bg-gray-800 dark:text-white rounded-xl shadow-md pb-4" >
        <div class="w-full">
          <img src="~/assets/images/avatar.png" alt="saffron bar" class="rounded-full w-32 h-32 mx-auto -translate-y-1/2 border-brandOrange border-4">
        </div>
        <div class="w-full flex items-end justify-between -mt-16 px-12" >
          <div class="flex flex-col">
            <strong class="lg:text-2xl">پویا نوروزی</strong>
            <span class="opacity-60 text-sm lg:text-base">متخصص IT</span>
          </div>
          <div class="flex items-center">
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M9.15333 2.34001L10.3267 4.68668C10.4867 5.01334 10.9133 5.32668 11.2733 5.38668L13.4 5.74001C14.76 5.96668 15.08 6.95334 14.1 7.92668L12.4467 9.58001C12.1667 9.86001 12.0133 10.4 12.1 10.7867L12.5733 12.8333C12.9467 14.4533 12.0867 15.08 10.6533 14.2333L8.66 13.0533C8.3 12.84 7.70667 12.84 7.34 13.0533L5.34667 14.2333C3.92 15.08 3.05333 14.4467 3.42667 12.8333L3.9 10.7867C3.98667 10.4 3.83333 9.86001 3.55333 9.58001L1.9 7.92668C0.926667 6.95334 1.24 5.96668 2.6 5.74001L4.72667 5.38668C5.08 5.32668 5.50667 5.01334 5.66667 4.68668L6.84 2.34001C7.48 1.06668 8.52 1.06668 9.15333 2.34001Z" stroke="#CCA253" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>

          </div>
        </div>
        <hr class="my-4 mx-4">
        <div class="flex flex-col px-12 font-estedad text-justify space-y-2">
          <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.5">
              <path d="M10.9999 5.82501H8.09994C7.33494 5.82501 6.80994 5.245 6.80994 4.535V2.92499C6.80994 2.21499 7.33494 1.63501 8.09994 1.63501H9.70994C10.4199 1.63501 10.9999 2.21499 10.9999 2.92499V5.82501Z" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M11 5.82495C11 8.84995 10.435 9.34992 8.73499 10.3599" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M5.185 5.82501H2.285C1.52 5.82501 0.994995 5.245 0.994995 4.535V2.92499C0.994995 2.21499 1.52 1.63501 2.285 1.63501H3.9C4.61 1.63501 5.19 2.21499 5.19 2.92499V5.82501" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M5.18504 5.82495C5.18504 8.84995 4.62004 9.34992 2.92004 10.3599" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
            </g>
          </svg>
          <p class="text-sm lg:text-base">
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارها.
          </p>
          <svg class="mr-auto" width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.5">
              <path d="M1 6.17499H3.9C4.665 6.17499 5.19 6.755 5.19 7.465V9.07501C5.19 9.78501 4.665 10.365 3.9 10.365H2.29C1.58 10.365 1 9.78501 1 9.07501V6.17499Z" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M1.00001 6.17505C1.00001 3.15005 1.56501 2.65008 3.26501 1.64008" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M6.815 6.17499H9.715C10.48 6.17499 11.005 6.755 11.005 7.465V9.07501C11.005 9.78501 10.48 10.365 9.715 10.365H8.1C7.39 10.365 6.81 9.78501 6.81 9.07501V6.17499" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M6.81502 6.17505C6.81502 3.15005 7.38002 2.65008 9.08002 1.64008" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
            </g>
          </svg>
        </div>
        <div class="w-full flex relative">
          <NuxtLink to="/" class="bg-[#EF4056] w-max text-white px-6 py-2 rounded-full mx-auto absolute right-1/2 translate-x-1/2 bottom-0 translate-y-3/4 text-sm lg:text-base">
            مشاهده نظر در دیجی کالا
          </NuxtLink>
        </div>
      </li>
      <li class="card bg-bgWhite dark:bg-gray-800 dark:text-white rounded-xl shadow-md pb-4" >
        <div class="w-full">
          <img src="~/assets/images/avatar.png" alt="saffron bar" class="rounded-full w-32 h-32 mx-auto -translate-y-1/2 border-brandOrange border-4">
        </div>
        <div class="w-full flex items-end justify-between -mt-16 px-12" >
          <div class="flex flex-col">
            <strong class="lg:text-2xl">سجاد میرشبی</strong>
            <span class="opacity-60 text-sm lg:text-base">برنامه نویس و طراح سایت</span>
          </div>
          <div class="flex items-center">
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M3.82665 10.6666C3.89999 10.3399 3.76665 9.87325 3.53332 9.63992L1.91332 8.01992C1.40665 7.51325 1.20665 6.97325 1.35332 6.50659C1.50665 6.03992 1.97999 5.71992 2.68665 5.59992L4.76665 5.25325C5.06665 5.19992 5.43332 4.93325 5.57332 4.65992L6.71999 2.35992C7.05332 1.69992 7.50665 1.33325 7.99999 1.33325C8.49332 1.33325 8.94665 1.69992 9.27999 2.35992L10.4267 4.65992C10.5133 4.83325 10.6933 4.99992 10.8867 5.11325L3.70665 12.2933C3.61332 12.3866 3.45332 12.2999 3.47999 12.1666L3.82665 10.6666Z" fill="#CCA253"/>
              <path d="M12.4667 9.64001C12.2267 9.88001 12.0934 10.34 12.1734 10.6667L12.6334 12.6733C12.8267 13.5067 12.7067 14.1333 12.2934 14.4333C12.1267 14.5533 11.9267 14.6133 11.6934 14.6133C11.3534 14.6133 10.9534 14.4867 10.5134 14.2267L8.56003 13.0667C8.25337 12.8867 7.7467 12.8867 7.44003 13.0667L5.4867 14.2267C4.7467 14.66 4.11337 14.7333 3.7067 14.4333C3.55337 14.32 3.44003 14.1667 3.3667 13.9667L11.4734 5.86001C11.78 5.55335 12.2134 5.41335 12.6334 5.48668L13.3067 5.60001C14.0134 5.72001 14.4867 6.04001 14.64 6.50668C14.7867 6.97335 14.5867 7.51335 14.08 8.02001L12.4667 9.64001Z" fill="#CCA253"/>
            </svg>
            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M9.15333 2.34001L10.3267 4.68668C10.4867 5.01334 10.9133 5.32668 11.2733 5.38668L13.4 5.74001C14.76 5.96668 15.08 6.95334 14.1 7.92668L12.4467 9.58001C12.1667 9.86001 12.0133 10.4 12.1 10.7867L12.5733 12.8333C12.9467 14.4533 12.0867 15.08 10.6533 14.2333L8.66 13.0533C8.3 12.84 7.70667 12.84 7.34 13.0533L5.34667 14.2333C3.92 15.08 3.05333 14.4467 3.42667 12.8333L3.9 10.7867C3.98667 10.4 3.83333 9.86001 3.55333 9.58001L1.9 7.92668C0.926667 6.95334 1.24 5.96668 2.6 5.74001L4.72667 5.38668C5.08 5.32668 5.50667 5.01334 5.66667 4.68668L6.84 2.34001C7.48 1.06668 8.52 1.06668 9.15333 2.34001Z" stroke="#CCA253" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>

          </div>
        </div>
        <hr class="my-4 mx-4">
        <div class="flex flex-col px-12 font-estedad text-justify space-y-2">
          <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.5">
              <path d="M10.9999 5.82501H8.09994C7.33494 5.82501 6.80994 5.245 6.80994 4.535V2.92499C6.80994 2.21499 7.33494 1.63501 8.09994 1.63501H9.70994C10.4199 1.63501 10.9999 2.21499 10.9999 2.92499V5.82501Z" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M11 5.82495C11 8.84995 10.435 9.34992 8.73499 10.3599" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M5.185 5.82501H2.285C1.52 5.82501 0.994995 5.245 0.994995 4.535V2.92499C0.994995 2.21499 1.52 1.63501 2.285 1.63501H3.9C4.61 1.63501 5.19 2.21499 5.19 2.92499V5.82501" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M5.18504 5.82495C5.18504 8.84995 4.62004 9.34992 2.92004 10.3599" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
            </g>
          </svg>
          <p class="text-sm lg:text-base">
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارها.
          </p>
          <svg class="mr-auto" width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.5">
              <path d="M1 6.17499H3.9C4.665 6.17499 5.19 6.755 5.19 7.465V9.07501C5.19 9.78501 4.665 10.365 3.9 10.365H2.29C1.58 10.365 1 9.78501 1 9.07501V6.17499Z" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M1.00001 6.17505C1.00001 3.15005 1.56501 2.65008 3.26501 1.64008" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M6.815 6.17499H9.715C10.48 6.17499 11.005 6.755 11.005 7.465V9.07501C11.005 9.78501 10.48 10.365 9.715 10.365H8.1C7.39 10.365 6.81 9.78501 6.81 9.07501V6.17499" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M6.81502 6.17505C6.81502 3.15005 7.38002 2.65008 9.08002 1.64008" stroke="#292D32" stroke-linecap="round" stroke-linejoin="round"/>
            </g>
          </svg>
        </div>
        <div class="w-full flex relative">
          <NuxtLink to="/" class="bg-[#EF4056] w-max text-white px-6 py-2 rounded-full mx-auto absolute right-1/2 translate-x-1/2 bottom-0 translate-y-3/4 text-sm lg:text-base">
            مشاهده نظر در دیجی کالا
          </NuxtLink>
        </div>
      </li>
    </ul>
  </div>-->
</template>

<script setup lang="ts">

import type {ProductFilterData} from "~/models/product/productQueries";
import {GetProducts} from "~/services/product.service";
import {EOrderBy} from "~/models/product/EOrderBy";

const loading = ref(false);
const lastProducts:Ref<ProductFilterData[]> = ref([]);

onMounted(async ()=>{
  loading.value = true;

  const lastProductsResult = await GetProducts({
    pageId:1,
    orderBy:EOrderBy.Newest,
    take:6,
  });
  if(lastProductsResult.isSuccess){
    lastProducts.value = lastProductsResult.data?.data!;
  }

  loading.value = false;
})

</script>